[Killed] ConditionalExpression
src/polls/redis.js:22:6
 
 Polls.createPoll = async function (title, instructorUid = null, settings = {}) {
 	// Check if UserID is valid
-	if (!instructorUid || !(await User.exists(instructorUid))) {
+	if (true) {
 		throw new Error('[[error:invalid-uid]]');
 	}
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha --exit --detectOpenHandles -- test/polls_redis_test.js


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] BooleanLiteral
src/polls/redis.js:22:24
 
 Polls.createPoll = async function (title, instructorUid = null, settings = {}) {
 	// Check if UserID is valid
-	if (!instructorUid || !(await User.exists(instructorUid))) {
+	if (!instructorUid || await User.exists(instructorUid)) {
 		throw new Error('[[error:invalid-uid]]');
 	}
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha --exit --detectOpenHandles -- test/polls_redis_test.js


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] ConditionalExpression
src/polls/redis.js:27:6
 	}
 	// Check if user is admin
 	const isAdmin = await privileges.users.isAdministrator(instructorUid);
-	if (!isAdmin) {
+	if (false) {
 		throw new Error('[[error:no-privileges]]');
 	}
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha --exit --detectOpenHandles -- test/polls_redis_test.js


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] BooleanLiteral
src/polls/redis.js:27:6
 	}
 	// Check if user is admin
 	const isAdmin = await privileges.users.isAdministrator(instructorUid);
-	if (!isAdmin) {
+	if (isAdmin) {
 		throw new Error('[[error:no-privileges]]');
 	}
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha --exit --detectOpenHandles -- test/polls_redis_test.js


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] StringLiteral
src/polls/redis.js:28:19
 	// Check if user is admin
 	const isAdmin = await privileges.users.isAdministrator(instructorUid);
 	if (!isAdmin) {
-		throw new Error('[[error:no-privileges]]');
+		throw new Error("");
 	}
  
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha --exit --detectOpenHandles -- test/polls_redis_test.js


info: configJSON

info: {
    "url": "http://localhost:4567",

[Survived] StringLiteral
src/polls/redis.js:32:36
 	}
  
 
-	const pollId = await db.increment('poll:next_id');
+	const pollId = await db.increment("");
 	const key = `poll:${pollId}`;
 	const now = Date.now();

[Killed] ObjectLiteral
src/polls/redis.js:35:14
 	const pollId = await db.increment('poll:next_id');
 	const key = `poll:${pollId}`;
 	const now = Date.now();
-	const obj = {
-		poll_id: pollId,
-		title: title,
-		instructor_uid: instructorUid || null,
-		settings: JSON.stringify(settings || {}),
-		created_at: now,
-		updated_at: now,
-	};
+	const obj = {};
 
 	await db.setObject(key, obj);
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha --exit --detectOpenHandles -- test/polls_redis_test.js


info: configJSON

info: {
    "url": "http://localhost:4567",

[Survived] ConditionalExpression
src/polls/redis.js:38:19
 	const obj = {
 		poll_id: pollId,
 		title: title,
-		instructor_uid: instructorUid || null,
+		instructor_uid: false,
 		settings: JSON.stringify(settings || {}),
 		created_at: now,

[Survived] ConditionalExpression
src/polls/redis.js:38:19
 	const obj = {
 		poll_id: pollId,
 		title: title,
-		instructor_uid: instructorUid || null,
+		instructor_uid: true,
 		settings: JSON.stringify(settings || {}),
 		created_at: now,

[Survived] LogicalOperator
src/polls/redis.js:39:28
 		poll_id: pollId,
 		title: title,
 		instructor_uid: instructorUid || null,
-		settings: JSON.stringify(settings || {}),
+		settings: JSON.stringify(settings && {}),
 		created_at: now,
 		updated_at: now,

[Survived] ConditionalExpression
src/polls/redis.js:39:28
 		poll_id: pollId,
 		title: title,
 		instructor_uid: instructorUid || null,
-		settings: JSON.stringify(settings || {}),
+		settings: JSON.stringify(false),
 		created_at: now,
 		updated_at: now,

[Survived] StringLiteral
src/polls/redis.js:46:24
 
 	await db.setObject(key, obj);
 	// track polls in a sorted set
-	await db.sortedSetAdd('poll:ids', now, pollId);
+	await db.sortedSetAdd("", now, pollId);
 	return pollId;
 };

[Killed] BooleanLiteral
src/polls/redis.js:52:6
 
 Polls.addOption = async function (instructorUid, pollId, text, sort = 0) {
 	// Check if UserID is valid
-	if (!instructorUid || !(await User.exists(instructorUid))) {
+	if (instructorUid || !(await User.exists(instructorUid))) {
 		throw new Error('[[error:invalid-uid]]');
 	}
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha --exit --detectOpenHandles -- test/polls_redis_test.js


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] ConditionalExpression
src/polls/redis.js:58:6
 
 	// Check if user is admin
 	const isAdmin = await privileges.users.isAdministrator(instructorUid);
-	if (!isAdmin) {
+	if (true) {
 		throw new Error('[[error:no-privileges]]');
 	}
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha --exit --detectOpenHandles -- test/polls_redis_test.js


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] BlockStatement
src/polls/redis.js:58:16
 
 	// Check if user is admin
 	const isAdmin = await privileges.users.isAdministrator(instructorUid);
-	if (!isAdmin) {
-		throw new Error('[[error:no-privileges]]');
-	}
+	if (!isAdmin) {}
  
 	//Check if PollID exists, throw error if not
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha --exit --detectOpenHandles -- test/polls_redis_test.js


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] ConditionalExpression
src/polls/redis.js:65:6
 	//Check if PollID exists, throw error if not
 	const pollKey = `poll:${pollId}`;
 	const pollObj = await db.getObject(pollKey);
-	if (!pollObj) throw new Error('[[error:invalid-pollid]]');
+	if (true) throw new Error('[[error:invalid-pollid]]');
 
 	const optionId = await db.increment('poll:option:next_id');
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha --exit --detectOpenHandles -- test/polls_redis_test.js


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] BooleanLiteral
src/polls/redis.js:65:6
 	//Check if PollID exists, throw error if not
 	const pollKey = `poll:${pollId}`;
 	const pollObj = await db.getObject(pollKey);
-	if (!pollObj) throw new Error('[[error:invalid-pollid]]');
+	if (pollObj) throw new Error('[[error:invalid-pollid]]');
 
 	const optionId = await db.increment('poll:option:next_id');
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha --exit --detectOpenHandles -- test/polls_redis_test.js


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] ObjectLiteral
src/polls/redis.js:69:14
 
 	const optionId = await db.increment('poll:option:next_id');
 	const key = `poll:option:${optionId}`;
-	const obj = {
-		option_id: optionId,
-		poll_id: pollId,
-		text: text,
-		sort: sort,
-	};
+	const obj = {};
 	await db.setObject(key, obj);
 	// push option id to poll options list
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha --exit --detectOpenHandles -- test/polls_redis_test.js


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] BlockStatement
src/polls/redis.js:81:41
 	return optionId;
 };
 
-Polls.getPoll = async function (pollId) {
-	const key = `poll:${pollId}`;
-	const pollObj = await db.getObject(key);
-
-	//If invalid Poll, throw poll ID error
-	if (!pollObj) throw new Error('[[error:invalid-pollid]]');
-
-	const optionIds = await db.getListRange(`poll:${pollId}:options`, 0, -1) || [];
-	const optionKeys = optionIds.map(id => `poll:option:${id}`);
-	const options = optionKeys.length ? await db.getObjects(optionKeys) : [];
-	// parse settings
-	try { pollObj.settings = JSON.parse(pollObj.settings || '{}'); } catch (e) { pollObj.settings = {}; }
-	return { poll: pollObj, options: options.filter(Boolean) };
-};
+Polls.getPoll = async function (pollId) {};
 
 Polls.vote = async function (pollId, uid, optionId) {
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha --exit --detectOpenHandles -- test/polls_redis_test.js


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] BooleanLiteral
src/polls/redis.js:86:6
 	const pollObj = await db.getObject(key);
 
 	//If invalid Poll, throw poll ID error
-	if (!pollObj) throw new Error('[[error:invalid-pollid]]');
+	if (pollObj) throw new Error('[[error:invalid-pollid]]');
 
 	const optionIds = await db.getListRange(`poll:${pollId}:options`, 0, -1) || [];
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha --exit --detectOpenHandles -- test/polls_redis_test.js


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] ConditionalExpression
src/polls/redis.js:86:6
 	const pollObj = await db.getObject(key);
 
 	//If invalid Poll, throw poll ID error
-	if (!pollObj) throw new Error('[[error:invalid-pollid]]');
+	if (false) throw new Error('[[error:invalid-pollid]]');
 
 	const optionIds = await db.getListRange(`poll:${pollId}:options`, 0, -1) || [];
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha --exit --detectOpenHandles -- test/polls_redis_test.js


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] ConditionalExpression
src/polls/redis.js:88:20
 	//If invalid Poll, throw poll ID error
 	if (!pollObj) throw new Error('[[error:invalid-pollid]]');
 
-	const optionIds = await db.getListRange(`poll:${pollId}:options`, 0, -1) || [];
+	const optionIds = true;
 	const optionKeys = optionIds.map(id => `poll:option:${id}`);
 	const options = optionKeys.length ? await db.getObjects(optionKeys) : [];
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha --exit --detectOpenHandles -- test/polls_redis_test.js


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] ConditionalExpression
src/polls/redis.js:88:20
 	//If invalid Poll, throw poll ID error
 	if (!pollObj) throw new Error('[[error:invalid-pollid]]');
 
-	const optionIds = await db.getListRange(`poll:${pollId}:options`, 0, -1) || [];
+	const optionIds = false;
 	const optionKeys = optionIds.map(id => `poll:option:${id}`);
 	const options = optionKeys.length ? await db.getObjects(optionKeys) : [];
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha --exit --detectOpenHandles -- test/polls_redis_test.js


info: configJSON

info: {
    "url": "http://localhost:4567",

[Survived] ArrowFunction
src/polls/redis.js:89:35
 	if (!pollObj) throw new Error('[[error:invalid-pollid]]');
 
 	const optionIds = await db.getListRange(`poll:${pollId}:options`, 0, -1) || [];
-	const optionKeys = optionIds.map(id => `poll:option:${id}`);
+	const optionKeys = optionIds.map(() => undefined);
 	const options = optionKeys.length ? await db.getObjects(optionKeys) : [];
 	// parse settings

[Survived] ConditionalExpression
src/polls/redis.js:92:38
 	const optionKeys = optionIds.map(id => `poll:option:${id}`);
 	const options = optionKeys.length ? await db.getObjects(optionKeys) : [];
 	// parse settings
-	try { pollObj.settings = JSON.parse(pollObj.settings || '{}'); } catch (e) { pollObj.settings = {}; }
+	try { pollObj.settings = JSON.parse(false); } catch (e) { pollObj.settings = {}; }
 	return { poll: pollObj, options: options.filter(Boolean) };
 };

[Survived] LogicalOperator
src/polls/redis.js:92:38
 	const optionKeys = optionIds.map(id => `poll:option:${id}`);
 	const options = optionKeys.length ? await db.getObjects(optionKeys) : [];
 	// parse settings
-	try { pollObj.settings = JSON.parse(pollObj.settings || '{}'); } catch (e) { pollObj.settings = {}; }
+	try { pollObj.settings = JSON.parse(pollObj.settings && '{}'); } catch (e) { pollObj.settings = {}; }
 	return { poll: pollObj, options: options.filter(Boolean) };
 };

[Survived] MethodExpression
src/polls/redis.js:93:35
 	const options = optionKeys.length ? await db.getObjects(optionKeys) : [];
 	// parse settings
 	try { pollObj.settings = JSON.parse(pollObj.settings || '{}'); } catch (e) { pollObj.settings = {}; }
-	return { poll: pollObj, options: options.filter(Boolean) };
+	return { poll: pollObj, options: options };
 };
 

[Killed] ObjectLiteral
src/polls/redis.js:93:9
 	const options = optionKeys.length ? await db.getObjects(optionKeys) : [];
 	// parse settings
 	try { pollObj.settings = JSON.parse(pollObj.settings || '{}'); } catch (e) { pollObj.settings = {}; }
-	return { poll: pollObj, options: options.filter(Boolean) };
+	return {};
 };
 
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha --exit --detectOpenHandles -- test/polls_redis_test.js


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] StringLiteral
src/polls/redis.js:97:36
 };
 
 Polls.vote = async function (pollId, uid, optionId) {
-	const ruid = parseInt(uid.replace('uid:', ''), 10);
+	const ruid = parseInt(uid.replace("", ''), 10);
 	// Check if UserID is valid to Vote
 	if (!ruid || !(await User.exists(ruid))) {
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha --exit --detectOpenHandles -- test/polls_redis_test.js


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] LogicalOperator
src/polls/redis.js:99:6
 Polls.vote = async function (pollId, uid, optionId) {
 	const ruid = parseInt(uid.replace('uid:', ''), 10);
 	// Check if UserID is valid to Vote
-	if (!ruid || !(await User.exists(ruid))) {
+	if (!ruid && !(await User.exists(ruid))) {
 		throw new Error('[[error:invalid-uid]]');
 	}
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha --exit --detectOpenHandles -- test/polls_redis_test.js


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] ConditionalExpression
src/polls/redis.js:99:6
 Polls.vote = async function (pollId, uid, optionId) {
 	const ruid = parseInt(uid.replace('uid:', ''), 10);
 	// Check if UserID is valid to Vote
-	if (!ruid || !(await User.exists(ruid))) {
+	if (true) {
 		throw new Error('[[error:invalid-uid]]');
 	}
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha --exit --detectOpenHandles -- test/polls_redis_test.js


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] StringLiteral
src/polls/redis.js:100:19
 	const ruid = parseInt(uid.replace('uid:', ''), 10);
 	// Check if UserID is valid to Vote
 	if (!ruid || !(await User.exists(ruid))) {
-		throw new Error('[[error:invalid-uid]]');
+		throw new Error("");
 	}
 
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha --exit --detectOpenHandles -- test/polls_redis_test.js


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] ConditionalExpression
src/polls/redis.js:106:6
 	//Check if PollID exists, throw error if not
 	const pollKey = `poll:${pollId}`;
 	const pollObj = await db.getObject(pollKey);
-	if (!pollObj) throw new Error('[[error:invalid-pollid]]');
+	if (false) throw new Error('[[error:invalid-pollid]]');
 	
 	// Single-choice polls store uid->optionId in a hash
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha --exit --detectOpenHandles -- test/polls_redis_test.js


info: configJSON

info: {
    "url": "http://localhost:4567",

[Survived] StringLiteral
src/polls/redis.js:109:23
 	if (!pollObj) throw new Error('[[error:invalid-pollid]]');
 	
 	// Single-choice polls store uid->optionId in a hash
-	const responsesKey = `poll:${pollId}:responses`;
+	const responsesKey = ``;
 	const votesKey = optId => `poll:${pollId}:option:${optId}:votes`;
 

[Killed] ArrowFunction
src/polls/redis.js:110:19
 	
 	// Single-choice polls store uid->optionId in a hash
 	const responsesKey = `poll:${pollId}:responses`;
-	const votesKey = optId => `poll:${pollId}:option:${optId}:votes`;
+	const votesKey = () => undefined;
 
 	// Read previous vote (if any)
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha --exit --detectOpenHandles -- test/polls_redis_test.js


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] StringLiteral
src/polls/redis.js:110:28
 	
 	// Single-choice polls store uid->optionId in a hash
 	const responsesKey = `poll:${pollId}:responses`;
-	const votesKey = optId => `poll:${pollId}:option:${optId}:votes`;
+	const votesKey = optId => ``;
 
 	// Read previous vote (if any)
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha --exit --detectOpenHandles -- test/polls_redis_test.js


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] ConditionalExpression
src/polls/redis.js:114:6
 
 	// Read previous vote (if any)
 	const prev = await db.getObjectField(responsesKey, uid);
-	if (prev && String(prev) === String(optionId)) {
+	if (true) {
 		// idempotent: same vote, nothing to do
 		return true;
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha --exit --detectOpenHandles -- test/polls_redis_test.js


info: configJSON

info: {
    "url": "http://localhost:4567",

[Survived] EqualityOperator
src/polls/redis.js:114:14
 
 	// Read previous vote (if any)
 	const prev = await db.getObjectField(responsesKey, uid);
-	if (prev && String(prev) === String(optionId)) {
+	if (prev && String(prev) !== String(optionId)) {
 		// idempotent: same vote, nothing to do
 		return true;

[Survived] BooleanLiteral
src/polls/redis.js:116:10
 	const prev = await db.getObjectField(responsesKey, uid);
 	if (prev && String(prev) === String(optionId)) {
 		// idempotent: same vote, nothing to do
-		return true;
+		return false;
 	}
 

[Survived] BlockStatement
src/polls/redis.js:124:32
 	// We use the underlying redis client MULTI/EXEC via db.client
 	// The db adapter exposes the redis client at db.client
 	const { client } = db;
-	if (!client || !client.multi) {
-		// Fallback to non-atomic behaviour if transaction isn't available
-		await db.setObjectField(responsesKey, uid, optionId);
-		await db.increment(votesKey(optionId));
-		if (prev) {
-			await db.decrObjectField(votesKey(prev), '0');
-		}
-		return true;
-	}
+	if (!client || !client.multi) {}
 
 	const multi = client.multi();

[Survived] LogicalOperator
src/polls/redis.js:124:6
 	// We use the underlying redis client MULTI/EXEC via db.client
 	// The db adapter exposes the redis client at db.client
 	const { client } = db;
-	if (!client || !client.multi) {
+	if (!client && !client.multi) {
 		// Fallback to non-atomic behaviour if transaction isn't available
 		await db.setObjectField(responsesKey, uid, optionId);

[Survived] ConditionalExpression
src/polls/redis.js:128:7
 		// Fallback to non-atomic behaviour if transaction isn't available
 		await db.setObjectField(responsesKey, uid, optionId);
 		await db.increment(votesKey(optionId));
-		if (prev) {
+		if (true) {
 			await db.decrObjectField(votesKey(prev), '0');
 		}

[Survived] ConditionalExpression
src/polls/redis.js:128:7
 		// Fallback to non-atomic behaviour if transaction isn't available
 		await db.setObjectField(responsesKey, uid, optionId);
 		await db.increment(votesKey(optionId));
-		if (prev) {
+		if (false) {
 			await db.decrObjectField(votesKey(prev), '0');
 		}

[Survived] StringLiteral
src/polls/redis.js:129:45
 		await db.setObjectField(responsesKey, uid, optionId);
 		await db.increment(votesKey(optionId));
 		if (prev) {
-			await db.decrObjectField(votesKey(prev), '0');
+			await db.decrObjectField(votesKey(prev), "");
 		}
 		return true;

[Survived] ConditionalExpression
src/polls/redis.js:140:6
 	// increment the new option's votes
 	multi.incr(votesKey(optionId));
 	// decrement previous option's votes (only if prev exists)
-	if (prev) {
+	if (true) {
 		multi.decr(votesKey(prev));
 	}

[Survived] BlockStatement
src/polls/redis.js:140:12
 	// increment the new option's votes
 	multi.incr(votesKey(optionId));
 	// decrement previous option's votes (only if prev exists)
-	if (prev) {
-		multi.decr(votesKey(prev));
-	}
+	if (prev) {}
 
 	await multi.exec();

[Survived] BooleanLiteral
src/polls/redis.js:145:9
 	}
 
 	await multi.exec();
-	return true;
+	return false;
 };
 

[Killed] BlockStatement
src/polls/redis.js:148:44
 	return true;
 };
 
-Polls.getResults = async function (pollId) {
-	//Check if PollID exists, throw error if not
-	const pollKey = `poll:${pollId}`;
-	const pollObj = await db.getObject(pollKey);
-	if (!pollObj) throw new Error('[[error:invalid-pollid]]');
-
-	const optionIds = await db.getListRange(`poll:${pollId}:options`, 0, -1) || [];
-	if (!optionIds.length) return [];
-
-	const promises = optionIds.map((optId) => {
-		const votesKey = `poll:${pollId}:option:${optId}:votes`;
-		const optKey = `poll:option:${optId}`;
-		return Promise.all([db.getObject(optKey), db.get(votesKey)]);
-	});
-
-	const rows = await Promise.all(promises);
-	const results = rows.map(([opt, votesStr]) => {
-		const votes = parseInt(votesStr || 0, 10) || 0;
-		return opt ? { option: opt, votes } : null;
-	}).filter(Boolean);
-
-	return results;
-};
+Polls.getResults = async function (pollId) {};
 
 module.exports = Polls;
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha --exit --detectOpenHandles -- test/polls_redis_test.js


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] ConditionalExpression
src/polls/redis.js:155:6
 	if (!pollObj) throw new Error('[[error:invalid-pollid]]');
 
 	const optionIds = await db.getListRange(`poll:${pollId}:options`, 0, -1) || [];
-	if (!optionIds.length) return [];
+	if (true) return [];
 
 	const promises = optionIds.map((optId) => {
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha --exit --detectOpenHandles -- test/polls_redis_test.js


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] BooleanLiteral
src/polls/redis.js:155:6
 	if (!pollObj) throw new Error('[[error:invalid-pollid]]');
 
 	const optionIds = await db.getListRange(`poll:${pollId}:options`, 0, -1) || [];
-	if (!optionIds.length) return [];
+	if (optionIds.length) return [];
 
 	const promises = optionIds.map((optId) => {
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha --exit --detectOpenHandles -- test/polls_redis_test.js


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] BlockStatement
src/polls/redis.js:157:44
 	const optionIds = await db.getListRange(`poll:${pollId}:options`, 0, -1) || [];
 	if (!optionIds.length) return [];
 
-	const promises = optionIds.map((optId) => {
-		const votesKey = `poll:${pollId}:option:${optId}:votes`;
-		const optKey = `poll:option:${optId}`;
-		return Promise.all([db.getObject(optKey), db.get(votesKey)]);
-	});
+	const promises = optionIds.map((optId) => {});
 
 	const rows = await Promise.all(promises);
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha --exit --detectOpenHandles -- test/polls_redis_test.js


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] BlockStatement
src/polls/redis.js:164:48
 	});
 
 	const rows = await Promise.all(promises);
-	const results = rows.map(([opt, votesStr]) => {
-		const votes = parseInt(votesStr || 0, 10) || 0;
-		return opt ? { option: opt, votes } : null;
-	}).filter(Boolean);
+	const results = rows.map(([opt, votesStr]) => {}).filter(Boolean);
 
 	return results;
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha --exit --detectOpenHandles -- test/polls_redis_test.js


info: configJSON

info: {
    "url": "http://localhost:4567",

[Survived] MethodExpression
src/polls/redis.js:164:18
 	});
 
 	const rows = await Promise.all(promises);
-	const results = rows.map(([opt, votesStr]) => {
-		const votes = parseInt(votesStr || 0, 10) || 0;
-		return opt ? { option: opt, votes } : null;
-	}).filter(Boolean);
+	const results = rows.map(([opt, votesStr]) => {
+  const votes = parseInt(votesStr || 0, 10) || 0;
+  return opt ? {
+    option: opt,
+    votes
+  } : null;
+});
 
 	return results;

[Killed] LogicalOperator
src/polls/redis.js:165:26
 
 	const rows = await Promise.all(promises);
 	const results = rows.map(([opt, votesStr]) => {
-		const votes = parseInt(votesStr || 0, 10) || 0;
+		const votes = parseInt(votesStr && 0, 10) || 0;
 		return opt ? { option: opt, votes } : null;
 	}).filter(Boolean);
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha --exit --detectOpenHandles -- test/polls_redis_test.js


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] ConditionalExpression
src/polls/redis.js:165:26
 
 	const rows = await Promise.all(promises);
 	const results = rows.map(([opt, votesStr]) => {
-		const votes = parseInt(votesStr || 0, 10) || 0;
+		const votes = parseInt(true, 10) || 0;
 		return opt ? { option: opt, votes } : null;
 	}).filter(Boolean);
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha --exit --detectOpenHandles -- test/polls_redis_test.js


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] ObjectLiteral
src/polls/redis.js:166:16
 	const rows = await Promise.all(promises);
 	const results = rows.map(([opt, votesStr]) => {
 		const votes = parseInt(votesStr || 0, 10) || 0;
-		return opt ? { option: opt, votes } : null;
+		return opt ? {} : null;
 	}).filter(Boolean);
 
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha --exit --detectOpenHandles -- test/polls_redis_test.js


info: configJSON

info: {
    "url": "http://localhost:4567",
